Repository: crazyball666/Conn
Catalog: Conn/Conn/Localizable.xcstrings
Source language: zh_hans
Languages: en, ja, ko, zh_hant

source: Control Mode 支持 %@，但本次连接未成功启用。
en: Control Mode supports %@, but it could not be enabled for this connection.
ja: Control Mode は %@ に対応していますが、今回の接続では有効にできませんでした。
ko: Control Mode에서 %@을(를) 지원하지만 이번 연결에서는 활성화하지 못했습니다.
zh_hant: Control Mode 支援 %@，但此次連線未能成功啟用。

source: Pane 标题、命令或路径来自最近快照；订阅首次更新后会切换为实时状态。
en: Pane titles, commands, and paths are from the latest snapshot. Live data will replace them after the first subscription update.
ja: ペインのタイトル、コマンド、パスは最新のスナップショットです。最初のサブスクリプション更新後にリアルタイムデータへ切り替わります。
ko: Pane 제목, 명령 및 경로는 최근 스냅샷의 값입니다. 첫 구독 업데이트 후 실시간 데이터로 전환됩니다.
zh_hant: Pane 標題、命令或路徑來自最新快照；首次訂閱更新後將切換為即時狀態。

source: Session 名称（可选）
en: Session Name (Optional)
ja: セッション名（任意）
ko: Session 이름(선택 사항)
zh_hant: Session 名稱（選填）

source: tmux 不可用
en: tmux Unavailable
ja: tmux を利用できません
ko: tmux 사용 불가
zh_hant: tmux 無法使用

source: tmux 管理失败
en: tmux Management Failed
ja: tmux の管理に失敗しました
ko: tmux 관리 실패
zh_hant: tmux 管理失敗

source: 上下分屏
en: Split Vertically
ja: 上下に分割
ko: 상하 분할
zh_hant: 上下分割

source: 修改持久终端别名会同步重命名远程会话；留空将恢复当前会话名称。
en: Changing the persistent terminal alias also renames the remote session. Leave blank to restore the current session name.
ja: 永続ターミナルの別名を変更すると、リモートセッション名も変更されます。空欄にすると現在のセッション名に戻ります。
ko: 지속 터미널 별칭을 변경하면 원격 Session 이름도 함께 변경됩니다. 비워 두면 현재 Session 이름으로 복원됩니다.
zh_hant: 修改持久終端別名時，遠端 Session 也會同步重新命名；留空則恢復目前的 Session 名稱。

source: 关闭 Pane
en: Close Pane
ja: ペインを閉じる
ko: Pane 닫기
zh_hant: 關閉 Pane

source: 关闭 Window
en: Close Window
ja: ウィンドウを閉じる
ko: Window 닫기
zh_hant: 關閉 Window

source: 其他连接：%@。
en: Other connections: %@.
ja: その他の接続：%@。
ko: 기타 연결: %@.
zh_hant: 其他連線：%@。

source: 兼容性与隔离状态
en: Compatibility and Isolation
ja: 互換性と分離状態
ko: 호환성 및 격리 상태
zh_hant: 相容性與隔離狀態

source: 切换
en: Switch
ja: 切り替え
ko: 전환
zh_hant: 切換

source: 切换到 Pane
en: Switch to Pane
ja: ペインに切り替え
ko: Pane으로 전환
zh_hant: 切換至 Pane

source: 创建 Session
en: Create Session
ja: セッションを作成
ko: Session 생성
zh_hant: 建立 Session

source: 创建并连接
en: Create and Connect
ja: 作成して接続
ko: 생성 및 연결
zh_hant: 建立並連線

source: 刷新 Session 列表
en: Refresh Session List
ja: セッション一覧を更新
ko: Session 목록 새로 고침
zh_hant: 重新整理 Session 列表

source: 取消 Zoom
en: Exit Zoom
ja: ズームを解除
ko: 확대 해제
zh_hant: 取消放大

source: 可返回终端创建流程并新建 Session。
en: Return to terminal creation to create a new Session.
ja: ターミナル作成画面に戻って新しいセッションを作成できます。
ko: 터미널 생성 화면으로 돌아가 새 Session을 생성할 수 있습니다.
zh_hant: 可返回終端建立流程並新增 Session。

source: 同一 Session 关联多个 Conn 终端，请选择需要操作的终端。
en: Multiple Conn terminals are linked to this Session. Select the terminal to control.
ja: 同じセッションに複数の Conn ターミナルが関連付けられています。操作するターミナルを選択してください。
ko: 동일한 Session에 여러 Conn 터미널이 연결되어 있습니다. 제어할 터미널을 선택하세요.
zh_hant: 同一 Session 已連結多個 Conn 終端，請選擇要操作的終端。

source: 名称不能为空或包含控制字符
en: The name cannot be empty or contain control characters.
ja: 名前を空にしたり、制御文字を含めたりすることはできません。
ko: 이름은 비워 둘 수 없으며 제어 문자를 포함할 수 없습니다.
zh_hant: 名稱不可為空白或包含控制字元。

source: 启动独立远程 Shell
en: Start a Standalone Remote Shell
ja: 独立したリモート Shell を起動
ko: 독립 원격 Shell 시작
zh_hant: 啟動獨立遠端 Shell

source: 将影响 %d 个 Session、%d 个 Window、%d 个 Pane，可能影响 %d 个其他连接。
en: This will affect %d Sessions, %d Windows, and %d Panes, and may affect %d other connections.
ja: %d 個のセッション、%d 個のウィンドウ、%d 個のペインに影響し、ほかの %d 件の接続にも影響する可能性があります。
ko: Session %d개, Window %d개, Pane %d개에 영향을 주며 다른 연결 %d개에도 영향을 줄 수 있습니다.
zh_hant: 這將影響 %d 個 Session、%d 個 Window、%d 個 Pane，並可能影響 %d 個其他連線。

source: 左右分屏
en: Split Horizontally
ja: 左右に分割
ko: 좌우 분할
zh_hant: 左右分割

source: 已断开
en: Disconnected
ja: 切断済み
ko: 연결 끊김
zh_hant: 已中斷連線

source: 已连接
en: Connected
ja: 接続済み
ko: 연결됨
zh_hant: 已連線

source: 当前 tmux 不支持 active-pane，切换 Pane 可能改变其他客户端看到的活动 Pane。
en: This tmux version does not support active-pane isolation. Switching Panes may change the active Pane shown in other clients.
ja: 現在の tmux は active-pane に対応していません。ペインを切り替えると、ほかのクライアントのアクティブペインが変わる場合があります。
ko: 현재 tmux는 active-pane을 지원하지 않습니다. Pane을 전환하면 다른 클라이언트에 표시되는 활성 Pane이 변경될 수 있습니다.
zh_hant: 目前的 tmux 不支援 active-pane；切換 Pane 可能會變更其他用戶端看到的作用中 Pane。

source: 当前 tmux 不支持 ignore-size，多客户端同时连接时窗口尺寸可能互相影响。
en: This tmux version does not support ignore-size. Window sizes may interfere with each other when multiple clients are connected.
ja: 現在の tmux は ignore-size に対応していません。複数のクライアントが同時に接続すると、ウィンドウサイズが互いに影響する場合があります。
ko: 현재 tmux는 ignore-size를 지원하지 않습니다. 여러 클라이언트가 동시에 연결되면 Window 크기가 서로 영향을 줄 수 있습니다.
zh_hant: 目前的 tmux 不支援 ignore-size；多個用戶端同時連線時，Window 尺寸可能互相影響。

source: 当前 tmux 不支持格式订阅，Pane 元数据使用按需快照，可能不是实时值。
en: This tmux version does not support format subscriptions. Pane metadata uses on-demand snapshots and may not be current.
ja: 現在の tmux はフォーマットサブスクリプションに対応していません。ペインのメタデータはオンデマンドのスナップショットで、最新ではない場合があります。
ko: 현재 tmux는 형식 구독을 지원하지 않습니다. Pane 메타데이터는 요청 시 스냅샷을 사용하므로 최신 값이 아닐 수 있습니다.
zh_hant: 目前的 tmux 不支援格式訂閱；Pane 中繼資料使用隨選快照，可能不是即時值。

source: 当前版本未配置可用的持久终端 Provider
en: No persistent terminal Provider is configured in this version.
ja: このバージョンには利用可能な永続ターミナル Provider が設定されていません。
ko: 현재 버전에 사용 가능한 지속 터미널 Provider가 구성되지 않았습니다.
zh_hant: 目前版本未設定可用的持久終端 Provider。

source: 持久终端：%@
en: Persistent Terminal: %@
ja: 永続ターミナル：%@
ko: 지속 터미널: %@
zh_hant: 持久終端：%@

source: 新建 Window
en: New Window
ja: 新規ウィンドウ
ko: 새 Window
zh_hant: 新增 Window

source: 暂无 tmux Session
en: No tmux Sessions
ja: tmux セッションなし
ko: tmux Session 없음
zh_hant: 暫無 tmux Session

source: 暂无可用 Session
en: No Available Sessions
ja: 利用可能なセッションなし
ko: 사용 가능한 Session 없음
zh_hant: 暫無可用 Session

source: 暂无可用主机
en: No Available Hosts
ja: 利用可能なホストなし
ko: 사용 가능한 호스트 없음
zh_hant: 暫無可用主機

source: 暂无终端
en: No Terminals
ja: ターミナルなし
ko: 터미널 없음
zh_hant: 暫無終端

source: 未知错误
en: Unknown Error
ja: 不明なエラー
ko: 알 수 없는 오류
zh_hant: 未知錯誤

source: 检测到多个尺寸参与者，但部分 Conn 终端尚未隔离窗口尺寸，系统会自动重试。
en: Multiple size participants were detected, but window-size isolation is not yet active for some Conn terminals. The system will retry automatically.
ja: 複数のサイズ参加者が検出されましたが、一部の Conn ターミナルではウィンドウサイズがまだ分離されていません。システムが自動的に再試行します。
ko: 여러 크기 참여자가 감지되었지만 일부 Conn 터미널의 Window 크기 격리가 아직 활성화되지 않았습니다. 시스템에서 자동으로 다시 시도합니다.
zh_hant: 偵測到多個尺寸參與者，但部分 Conn 終端尚未隔離 Window 尺寸；系統將自動重試。

source: 正在创建终端…
en: Creating terminal…
ja: ターミナルを作成しています…
ko: 터미널 생성 중…
zh_hant: 正在建立終端…

source: 正在加载 Session 列表…
en: Loading Sessions…
ja: セッション一覧を読み込んでいます…
ko: Session 목록 불러오는 중…
zh_hant: 正在載入 Session 列表…

source: 正在加载 tmux 拓扑…
en: Loading tmux topology…
ja: tmux トポロジーを読み込んでいます…
ko: tmux 토폴로지 불러오는 중…
zh_hant: 正在載入 tmux 拓撲…

source: 正在检测 tmux…
en: Detecting tmux…
ja: tmux を検出しています…
ko: tmux 감지 중…
zh_hant: 正在偵測 tmux…

source: 正在重连
en: Reconnecting
ja: 再接続中
ko: 다시 연결 중
zh_hant: 正在重新連線

source: 留空将恢复自动生成的名称。
en: Leave blank to restore the automatically generated name.
ja: 空欄にすると自動生成された名前に戻ります。
ko: 비워 두면 자동 생성된 이름으로 복원됩니다.
zh_hant: 留空將恢復自動產生的名稱。

source: 确认共享 tmux 操作
en: Confirm Shared tmux Operation
ja: 共有 tmux 操作を確認
ko: 공유 tmux 작업 확인
zh_hant: 確認共用 tmux 操作

source: 确认关闭 Pane
en: Confirm Pane Closure
ja: ペインを閉じる操作を確認
ko: Pane 닫기 확인
zh_hant: 確認關閉 Pane

source: 确认关闭 Window
en: Confirm Window Closure
ja: ウィンドウを閉じる操作を確認
ko: Window 닫기 확인
zh_hant: 確認關閉 Window

source: 确认执行
en: Confirm Operation
ja: 操作を確認
ko: 작업 확인
zh_hant: 確認執行

source: 确认终止 Session
en: Confirm Session Termination
ja: セッションの終了を確認
ko: Session 종료 확인
zh_hant: 確認終止 Session

source: 确认远程操作
en: Confirm Remote Operation
ja: リモート操作を確認
ko: 원격 작업 확인
zh_hant: 確認遠端操作

source: 终止 Session
en: Terminate Session
ja: セッションを終了
ko: Session 종료
zh_hant: 終止 Session

source: 终端会话不存在
en: Terminal Session Not Found
ja: ターミナルセッションが見つかりません
ko: 터미널 Session을 찾을 수 없음
zh_hant: 找不到終端 Session

source: 终端类型
en: Terminal Type
ja: ターミナルの種類
ko: 터미널 유형
zh_hant: 終端類型

source: 继续执行
en: Continue
ja: 続行
ko: 계속
zh_hant: 繼續執行

source: 脚本仅填入终端，不会自动执行。
en: The script is inserted into the terminal but is not run automatically.
ja: スクリプトはターミナルに入力されますが、自動実行はされません。
ko: 스크립트가 터미널에 입력되지만 자동으로 실행되지는 않습니다.
zh_hant: 指令碼只會填入終端，不會自動執行。

source: 该操作会修改 tmux 共享状态，影响 %d 个 Session。
en: This operation changes shared tmux state and affects %d Sessions.
ja: この操作は tmux の共有状態を変更し、%d 個のセッションに影響します。
ko: 이 작업은 공유 tmux 상태를 변경하며 Session %d개에 영향을 줍니다.
zh_hant: 此操作會修改 tmux 共用狀態，並影響 %d 個 Session。

source: 该终端会话可能已关闭。
en: This terminal session may have been closed.
ja: このターミナルセッションはすでに閉じられている可能性があります。
ko: 이 터미널 Session이 이미 닫혔을 수 있습니다.
zh_hant: 此終端 Session 可能已關閉。

source: 请先在“脚本”页面添加常用脚本
en: Add frequently used scripts on the Scripts page first.
ja: 先に「スクリプト」ページでよく使うスクリプトを追加してください。
ko: 먼저 ‘스크립트’ 페이지에서 자주 사용하는 스크립트를 추가하세요.
zh_hant: 請先在「指令碼」頁面新增常用指令碼

source: 路径未知
en: Unknown Path
ja: 不明なパス
ko: 알 수 없는 경로
zh_hant: 未知路徑

source: 返回不会关闭会话。仅“退出终端”或在会话列表中关闭时，才会终止该 PTY。
en: Going back does not close the session. The PTY is terminated only when you select “Exit Terminal” or close it from the session list.
ja: 戻るだけではセッションは閉じません。PTY は「ターミナルを終了」を選ぶか、セッション一覧から閉じた場合にのみ終了します。
ko: 뒤로 이동해도 Session은 닫히지 않습니다. ‘터미널 종료’를 선택하거나 Session 목록에서 닫을 때만 PTY가 종료됩니다.
zh_hant: 返回不會關閉 Session。只有選擇「退出終端」或從 Session 列表中關閉時，才會終止該 PTY。

source: 连接或创建可恢复的远程 Session
en: Connect to or create a resumable remote Session
ja: 再開可能なリモートセッションに接続または新規作成
ko: 재개 가능한 원격 Session에 연결하거나 새로 생성
zh_hant: 連線或建立可恢復的遠端 Session

source: 连接现有 Session
en: Connect to Existing Session
ja: 既存のセッションに接続
ko: 기존 Session에 연결
zh_hant: 連線至現有 Session

source: 选择持久终端
en: Select Persistent Terminal
ja: 永続ターミナルを選択
ko: 지속 터미널 선택
zh_hant: 選擇持久終端

source: 选择要控制的 Conn 终端
en: Select a Conn Terminal to Control
ja: 操作する Conn ターミナルを選択
ko: 제어할 Conn 터미널 선택
zh_hant: 選擇要控制的 Conn 終端

source: 部分 Conn 终端尚未启用 Pane 焦点隔离，系统会在下一次拓扑同步时重试。
en: Pane focus isolation is not yet active for some Conn terminals. The system will retry during the next topology sync.
ja: 一部の Conn ターミナルではペインフォーカスの分離がまだ有効ではありません。次回のトポロジー同期時に再試行します。
ko: 일부 Conn 터미널에서 Pane 포커스 격리가 아직 활성화되지 않았습니다. 다음 토폴로지 동기화 시 다시 시도합니다.
zh_hant: 部分 Conn 終端尚未啟用 Pane 焦點隔離；系統將在下次拓撲同步時重試。

source: 部分 Pane 标题、命令或路径不可用或已过期，请刷新拓扑后再使用这些信息。
en: Some Pane titles, commands, or paths are unavailable or stale. Refresh the topology before using this information.
ja: 一部のペインのタイトル、コマンド、パスを利用できないか、情報が古くなっています。トポロジーを更新してから使用してください。
ko: 일부 Pane 제목, 명령 또는 경로를 사용할 수 없거나 정보가 오래되었습니다. 토폴로지를 새로 고친 후 사용하세요.
zh_hant: 部分 Pane 標題、命令或路徑無法使用或已過期，請重新整理拓撲後再使用這些資訊。

source: 部分 tmux 格式订阅未启用，Pane 元数据可能降级为快照。
en: Some tmux format subscriptions are not active. Pane metadata may fall back to snapshots.
ja: 一部の tmux フォーマットサブスクリプションが有効ではありません。ペインのメタデータはスナップショットにフォールバックする場合があります。
ko: 일부 tmux 형식 구독이 활성화되지 않았습니다. Pane 메타데이터가 스냅샷으로 대체될 수 있습니다.
zh_hant: 部分 tmux 格式訂閱未啟用；Pane 中繼資料可能降級為快照。

source: 当前主机平台仅支持此脚本的部分能力，仍可继续执行。
en: The current host platform supports only some capabilities of this script. You can still continue.
ja: 現在のホストプラットフォームでは、このスクリプトの一部の機能のみ利用できます。実行は続行できます。
ko: 현재 호스트 플랫폼에서는 이 스크립트의 일부 기능만 지원합니다. 계속 실행할 수 있습니다.
zh_hant: 目前主機平台僅支援此指令碼的部分功能，仍可繼續執行。

source: 远程主机缺少执行此脚本所需的命令。
en: The remote host is missing commands required by this script.
ja: リモートホストに、このスクリプトの実行に必要なコマンドがありません。
ko: 원격 호스트에 이 스크립트 실행에 필요한 명령이 없습니다.
zh_hant: 遠端主機缺少執行此指令碼所需的命令。

source: 远程主机缺少部分可选命令，脚本仍可继续执行。
en: The remote host is missing some optional commands. The script can still run.
ja: リモートホストに一部の任意コマンドがありませんが、スクリプトは実行できます。
ko: 원격 호스트에 일부 선택 명령이 없지만 스크립트는 계속 실행할 수 있습니다.
zh_hant: 遠端主機缺少部分選用命令，指令碼仍可繼續執行。

source: 部分脚本能力依赖的服务未运行，仍可继续执行。
en: Some services used by optional script capabilities are not running. You can still continue.
ja: スクリプトの一部機能が使用するサービスは実行されていませんが、実行は続行できます。
ko: 일부 스크립트 기능에 필요한 서비스가 실행 중이 아니지만 계속 실행할 수 있습니다.
zh_hant: 部分指令碼功能所需的服務尚未執行，仍可繼續執行。

source: 部分脚本能力受权限限制，仍可继续执行。
en: Some script capabilities are restricted by permissions. You can still continue.
ja: スクリプトの一部機能は権限により制限されていますが、実行は続行できます。
ko: 일부 스크립트 기능이 권한에 의해 제한되지만 계속 실행할 수 있습니다.
zh_hant: 部分指令碼功能受權限限制，仍可繼續執行。

source: 部分远程能力数据不可用，脚本仍可继续执行。
en: Some remote capability data is unavailable. The script can still run.
ja: 一部のリモート機能データを取得できませんが、スクリプトは実行できます。
ko: 일부 원격 기능 데이터를 사용할 수 없지만 스크립트는 계속 실행할 수 있습니다.
zh_hant: 部分遠端功能資料無法使用，指令碼仍可繼續執行。

source: 部分脚本要求无法确认，仍可继续执行。
en: Some script requirements could not be verified. You can still continue.
ja: スクリプトの一部要件を確認できませんが、実行は続行できます。
ko: 일부 스크립트 요구 사항을 확인할 수 없지만 계속 실행할 수 있습니다.
zh_hant: 部分指令碼需求無法確認，仍可繼續執行。

source: 部分脚本能力状态未知，仍可继续执行。
en: The status of some script capabilities is unknown. You can still continue.
ja: スクリプトの一部機能の状態は不明ですが、実行は続行できます。
ko: 일부 스크립트 기능 상태를 알 수 없지만 계속 실행할 수 있습니다.
zh_hant: 部分指令碼功能狀態未知，仍可繼續執行。

source: 暂无 Compose 项目
en: No Compose Projects
ja: Compose プロジェクトなし
ko: Compose 프로젝트 없음
zh_hant: 暫無 Compose 專案

source: 未找到匹配的 Compose 项目
en: No Matching Compose Projects
ja: 一致する Compose プロジェクトがありません
ko: 일치하는 Compose 프로젝트 없음
zh_hant: 找不到符合的 Compose 專案

source: 该项目暂无服务
en: No Services in This Project
ja: このプロジェクトにサービスはありません
ko: 이 프로젝트에 서비스 없음
zh_hant: 此專案暫無服務

source: 仅从当前会话的项目列表中移除，不会停止或删除远程主机上的 Docker 资源。
en: Removes the project only from this session's list. Docker resources on the remote host will not be stopped or deleted.
ja: 現在のセッションのプロジェクト一覧からのみ削除します。リモートホスト上の Docker リソースは停止または削除されません。
ko: 현재 세션의 프로젝트 목록에서만 제거합니다. 원격 호스트의 Docker 리소스는 중지되거나 삭제되지 않습니다.
zh_hant: 僅從目前工作階段的專案列表中移除，不會停止或刪除遠端主機上的 Docker 資源。

source: 该主机暂无容器
en: No Containers on This Host
ja: このホストにコンテナはありません
ko: 이 호스트에 컨테이너 없음
zh_hant: 此主機暫無容器

source: 未找到匹配的容器
en: No Matching Containers
ja: 一致するコンテナがありません
ko: 일치하는 컨테이너 없음
zh_hant: 找不到符合的容器

source: 暂无镜像
en: No Images
ja: イメージなし
ko: 이미지 없음
zh_hant: 暫無映像檔

source: 未找到匹配的镜像
en: No Matching Images
ja: 一致するイメージがありません
ko: 일치하는 이미지 없음
zh_hant: 找不到符合的映像檔

source: 暂无卷
en: No Volumes
ja: ボリュームなし
ko: 볼륨 없음
zh_hant: 暫無磁碟區

source: 未找到匹配的卷
en: No Matching Volumes
ja: 一致するボリュームがありません
ko: 일치하는 볼륨 없음
zh_hant: 找不到符合的磁碟區

source: 暂无网络
en: No Networks
ja: ネットワークなし
ko: 네트워크 없음
zh_hant: 暫無網路

source: 未找到匹配的网络
en: No Matching Networks
ja: 一致するネットワークがありません
ko: 일치하는 네트워크 없음
zh_hant: 找不到符合的網路

source: 暂无容器使用此镜像
en: No Containers Use This Image
ja: このイメージを使用しているコンテナはありません
ko: 이 이미지를 사용하는 컨테이너 없음
zh_hant: 暫無容器使用此映像檔

source: 暂无容器引用此卷
en: No Containers Reference This Volume
ja: このボリュームを参照しているコンテナはありません
ko: 이 볼륨을 참조하는 컨테이너 없음
zh_hant: 暫無容器參照此磁碟區

source: 暂无容器接入此网络
en: No Containers Use This Network
ja: このネットワークに接続しているコンテナはありません
ko: 이 네트워크에 연결된 컨테이너 없음
zh_hant: 暫無容器連接此網路

source: Docker 守护进程未运行。 请在远程主机上启动： sudo systemctl start docker
en: The Docker daemon is not running. Start it on the remote host: sudo systemctl start docker
ja: Docker デーモンが実行されていません。 リモートホストで起動してください： sudo systemctl start docker
ko: Docker 데몬이 실행 중이 아닙니다. 원격 호스트에서 시작하세요: sudo systemctl start docker
zh_hant: Docker 守護程式尚未執行。 請在遠端主機上啟動： sudo systemctl start docker

source: 每行填写一个 Docker 参数，格式为 --flag=value。空行及以 # 开头的行将被忽略；%@、%@、%@ 和 %@ 也可在此配置。
en: Enter one Docker argument per line using --flag=value. Blank lines and lines beginning with # are ignored. %@, %@, %@, and %@ can also be configured here.
ja: Docker 引数を 1 行に 1 つ、--flag=value の形式で入力します。空行と # で始まる行は無視されます。%@、%@、%@、%@ もここで設定できます。
ko: Docker 인수를 줄마다 하나씩 --flag=value 형식으로 입력하세요. 빈 줄과 #으로 시작하는 줄은 무시됩니다. %@, %@, %@ 및 %@도 여기에서 설정할 수 있습니다.
zh_hant: 每行輸入一個 Docker 參數，格式為 --flag=value。空白行與以 # 開頭的行將被忽略；%@、%@、%@ 和 %@ 也可在此設定。

source: 等待远程输出…
en: Waiting for remote output…
ja: リモート出力を待っています…
ko: 원격 출력 대기 중…
zh_hant: 正在等待遠端輸出…

source: 配置文件必须使用远程主机上的绝对路径。
en: The configuration file must use an absolute path on the remote host.
ja: 設定ファイルには、リモートホスト上の絶対パスを指定してください。
ko: 구성 파일은 원격 호스트의 절대 경로를 사용해야 합니다.
zh_hant: 設定檔必須使用遠端主機上的絕對路徑。

source: 权限不足，无法读取日志
en: Insufficient permission to read logs.
ja: 権限がないためログを読み込めません。
ko: 권한이 부족하여 로그를 읽을 수 없습니다.
zh_hant: 權限不足，無法讀取日誌。

source: 当前主机平台暂不支持日志采集
en: Log collection is not supported on the current host platform.
ja: 現在のホストプラットフォームではログ収集に対応していません。
ko: 현재 호스트 플랫폼에서는 로그 수집을 지원하지 않습니다.
zh_hant: 目前主機平台暫不支援日誌收集。

source: 日志采集暂不可用
en: Log Collection Unavailable
ja: ログ収集を利用できません
ko: 로그 수집 사용 불가
zh_hant: 日誌收集暫時無法使用

source: 部分日志来源不可用
en: Some Log Sources Unavailable
ja: 一部のログソースを利用できません
ko: 일부 로그 소스 사용 불가
zh_hant: 部分日誌來源無法使用

source: 未发现常用日志源。 可在终端中查看自定义路径。
en: No common log sources were found. Use the terminal to inspect a custom path.
ja: 一般的なログソースが見つかりません。 カスタムパスはターミナルで確認できます。
ko: 일반 로그 소스를 찾지 못했습니다. 터미널에서 사용자 지정 경로를 확인할 수 있습니다.
zh_hant: 找不到常用日誌來源。 可在終端中檢視自訂路徑。

source: 权限不足，无法读取完整进程信息
en: Insufficient permission to read complete process information.
ja: 権限がないため完全なプロセス情報を読み込めません。
ko: 권한이 부족하여 전체 프로세스 정보를 읽을 수 없습니다.
zh_hant: 權限不足，無法讀取完整程序資訊。

source: 当前主机平台暂不支持进程采集
en: Process collection is not supported on the current host platform.
ja: 現在のホストプラットフォームではプロセス収集に対応していません。
ko: 현재 호스트 플랫폼에서는 프로세스 수집을 지원하지 않습니다.
zh_hant: 目前主機平台暫不支援程序收集。

source: 进程采集暂不可用
en: Process Collection Unavailable
ja: プロセス収集を利用できません
ko: 프로세스 수집 사용 불가
zh_hant: 程序收集暫時無法使用

source: 部分进程详情不可用
en: Some Process Details Unavailable
ja: 一部のプロセス情報を利用できません
ko: 일부 프로세스 세부 정보 사용 불가
zh_hant: 部分程序詳細資料無法使用

source: “%@”将从本地列表中永久删除，但不会影响远程主机。
en: “%@” will be permanently removed from the local list. The remote host will not be affected.
ja: 「%@」をローカルリストから完全に削除します。リモートホストには影響しません。
ko: “%@”을(를) 로컬 목록에서 영구적으로 삭제합니다. 원격 호스트에는 영향을 주지 않습니다.
zh_hant: 「%@」將從本機列表中永久刪除，但不會影響遠端主機。

source: %d 个本地终端
en: %d local terminals
ja: ローカルターミナル %d 件
ko: 로컬 터미널 %d개
zh_hant: %d 個本機終端

source: 主机不存在或已被删除
en: The host does not exist or has been deleted.
ja: ホストが存在しないか、削除されています。
ko: 호스트가 없거나 삭제되었습니다.
zh_hant: 主機不存在或已被刪除。

source: 删除分组不会删除其中的主机。
en: Deleting the group will not delete its hosts.
ja: グループを削除しても、その中のホストは削除されません。
ko: 그룹을 삭제해도 그룹의 호스트는 삭제되지 않습니다.
zh_hant: 刪除群組不會刪除其中的主機。

source: 新增主机
en: Add Host
ja: ホストを追加
ko: 호스트 추가
zh_hant: 新增主機

source: 暂无主机
en: No Hosts
ja: ホストなし
ko: 호스트 없음
zh_hant: 暫無主機

source: 添加第一台主机以开始监控和管理
en: Add your first host to start monitoring and management.
ja: 最初のホストを追加して、監視と管理を開始します。
ko: 첫 번째 호스트를 추가하여 모니터링과 관리를 시작하세요.
zh_hant: 新增第一台主機以開始監控與管理

source: 连接失败，请下拉刷新重试
en: Connection failed. Pull down to refresh and try again.
ja: 接続に失敗しました。下に引いて更新し、再試行してください。
ko: 연결하지 못했습니다. 아래로 당겨 새로 고친 후 다시 시도하세요.
zh_hant: 連線失敗，請下拉重新整理後再試。

source: 连接成功
en: Connected
ja: 接続しました
ko: 연결됨
zh_hant: 連線成功

source: 无法读取本地配置，请重试。本地数据不会上传。
en: Unable to read the local configuration. Try again. Local data will not be uploaded.
ja: ローカル設定を読み込めません。再試行してください。ローカルデータがアップロードされることはありません。
ko: 로컬 구성을 읽을 수 없습니다. 다시 시도하세요. 로컬 데이터는 업로드되지 않습니다.
zh_hant: 無法讀取本機設定，請再試。本機資料不會上傳。

source: 密钥管理
en: Key Management
ja: 鍵管理
ko: 키 관리
zh_hant: 金鑰管理

source: 暂无密钥
en: No Keys
ja: 鍵なし
ko: 키 없음
zh_hant: 暫無金鑰

source: 暂无密钥，请先在“密钥管理”中生成或导入密钥。
en: No keys are available. Generate or import one in Key Management first.
ja: 利用可能な鍵がありません。先に「鍵管理」で生成またはインポートしてください。
ko: 사용 가능한 키가 없습니다. 먼저 ‘키 관리’에서 생성하거나 가져오세요.
zh_hant: 暫無可用金鑰，請先在「金鑰管理」中產生或匯入金鑰。

source: 生成 Ed25519 密钥并部署到主机，即可使用密钥认证。
en: Generate an Ed25519 key and deploy it to a host to use key-based authentication.
ja: Ed25519 鍵を生成してホストに配備すると、鍵認証を使用できます。
ko: Ed25519 키를 생성하여 호스트에 배포하면 키 인증을 사용할 수 있습니다.
zh_hant: 產生 Ed25519 金鑰並部署至主機，即可使用金鑰驗證。

source: 留空时将显示主机地址。
en: Leave blank to display the host address.
ja: 空欄の場合はホストアドレスが表示されます。
ko: 비워 두면 호스트 주소가 표시됩니다.
zh_hant: 留空時將顯示主機位址。

source: 暂无分组，请使用右上角“+”创建分组。
en: No groups are available. Use “+” in the upper-right corner to create one.
ja: グループがありません。右上の「+」から作成してください。
ko: 그룹이 없습니다. 오른쪽 상단의 ‘+’를 눌러 생성하세요.
zh_hant: 暫無群組，請使用右上角的「+」建立群組。

source: 暂无执行记录
en: No Run History
ja: 実行履歴なし
ko: 실행 기록 없음
zh_hant: 暫無執行記錄

source: 容器操作和脚本执行记录将显示在此处
en: Container operations and script runs will appear here.
ja: コンテナ操作とスクリプト実行の履歴がここに表示されます。
ko: 컨테이너 작업 및 스크립트 실행 기록이 여기에 표시됩니다.
zh_hant: 容器操作與腳本執行記錄將顯示於此。

source: 支持单行或多行 Shell 脚本。变量格式为 {{名称}} 或 {{名称:默认值}}，执行前需填写变量值。
en: Supports single-line and multi-line Shell scripts. Use {{name}} or {{name:default}} for variables; values are required before execution.
ja: 1 行または複数行の Shell スクリプトに対応しています。変数は {{名前}} または {{名前:既定値}} の形式で指定し、実行前に値を入力します。
ko: 한 줄 또는 여러 줄 Shell 스크립트를 지원합니다. 변수 형식은 {{이름}} 또는 {{이름:기본값}}이며 실행 전에 값을 입력해야 합니다.
zh_hant: 支援單行或多行 Shell 指令碼。變數格式為 {{名稱}} 或 {{名稱:預設值}}，執行前須填寫變數值。

source: 暂无分组，请先在“分组管理”中创建分组。
en: No groups are available. Create one in Group Management first.
ja: グループがありません。先に「グループ管理」で作成してください。
ko: 그룹이 없습니다. 먼저 ‘그룹 관리’에서 생성하세요.
zh_hant: 暫無群組，請先在「群組管理」中建立群組。

source: 暂无可用主机，请先在“主机”页面添加主机。
en: No hosts are available. Add a host on the Hosts page first.
ja: 利用可能なホストがありません。先に「ホスト」ページで追加してください。
ko: 사용 가능한 호스트가 없습니다. 먼저 ‘호스트’ 페이지에서 호스트를 추가하세요.
zh_hant: 暫無可用主機，請先在「主機」頁面新增主機。

source: 在终端中执行
en: Run in Terminal
ja: ターミナルで実行
ko: 터미널에서 실행
zh_hant: 在終端中執行

source: 暂无分组
en: No Groups
ja: グループなし
ko: 그룹 없음
zh_hant: 暫無群組

source: 使用右上角“+”创建分组
en: Use “+” in the upper-right corner to create a group.
ja: 右上の「+」からグループを作成します。
ko: 오른쪽 상단의 ‘+’를 눌러 그룹을 생성하세요.
zh_hant: 使用右上角的「+」建立群組

source: 未找到匹配的分组
en: No Matching Groups
ja: 一致するグループがありません
ko: 일치하는 그룹 없음
zh_hant: 找不到符合的群組

source: 暂无脚本
en: No Scripts
ja: スクリプトなし
ko: 스크립트 없음
zh_hant: 暫無指令碼

source: 未找到匹配的脚本
en: No Matching Scripts
ja: 一致するスクリプトがありません
ko: 일치하는 스크립트 없음
zh_hant: 找不到符合的指令碼

source: 读取脚本失败，请重试
en: Unable to load scripts. Try again.
ja: スクリプトを読み込めません。再試行してください。
ko: 스크립트를 불러올 수 없습니다. 다시 시도하세요.
zh_hant: 無法讀取指令碼，請再試。

source: 主机连接配置已变化，请重新检查后执行
en: The host connection configuration has changed. Review it before running again.
ja: ホストの接続設定が変更されました。確認してから再実行してください。
ko: 호스트 연결 구성이 변경되었습니다. 다시 확인한 후 실행하세요.
zh_hant: 主機連線設定已變更，請重新檢查後再執行。

source: 命中风险：%@
en: Detected risk: %@
ja: 検出されたリスク：%@
ko: 감지된 위험: %@
zh_hant: 偵測到風險：%@

source: 将对 %d 台主机执行。请输入 %@ 以确认。
en: This will run on %d hosts. Enter %@ to confirm.
ja: %d 台のホストで実行します。確認のため %@ と入力してください。
ko: 호스트 %d대에서 실행됩니다. 확인하려면 %@을(를) 입력하세요.
zh_hant: 即將在 %d 台主機上執行。請輸入 %@ 以確認。

source: 确认批量执行
en: Confirm Batch Run
ja: 一括実行を確認
ko: 일괄 실행 확인
zh_hant: 確認批次執行

source: 正在打开终端…
en: Opening terminal…
ja: ターミナルを開いています…
ko: 터미널 여는 중…
zh_hant: 正在開啟終端…

source: 当前用户缺少执行此脚本所需的权限。
en: The current user does not have the permissions required to run this script.
ja: 現在のユーザーには、このスクリプトの実行に必要な権限がありません。
ko: 현재 사용자에게 이 스크립트 실행에 필요한 권한이 없습니다.
zh_hant: 目前使用者缺少執行此指令碼所需的權限。

source: 执行此脚本所需的服务未运行。
en: A service required by this script is not running.
ja: このスクリプトに必要なサービスが実行されていません。
ko: 이 스크립트에 필요한 서비스가 실행되고 있지 않습니다.
zh_hant: 執行此指令碼所需的服務尚未執行。

source: 远程主机未提供执行此脚本所需的完整数据。
en: The remote host did not provide all data required by this script.
ja: リモートホストから、このスクリプトの実行に必要なデータをすべて取得できませんでした。
ko: 원격 호스트에서 이 스크립트 실행에 필요한 전체 데이터를 제공하지 않았습니다.
zh_hant: 遠端主機未提供執行此指令碼所需的完整資料。

source: 无法确认远程主机是否满足脚本要求。
en: Unable to determine whether the remote host meets the script requirements.
ja: リモートホストがスクリプトの要件を満たすか確認できません。
ko: 원격 호스트가 스크립트 요구 사항을 충족하는지 확인할 수 없습니다.
zh_hant: 無法確認遠端主機是否符合指令碼需求。

source: 远程主机暂时无法满足脚本要求。
en: The remote host temporarily does not meet the script requirements.
ja: リモートホストは一時的にスクリプトの要件を満たしていません。
ko: 원격 호스트가 일시적으로 스크립트 요구 사항을 충족하지 못합니다.
zh_hant: 遠端主機目前無法符合指令碼需求。

source: ；审计未保存
en: ; audit was not saved
ja: ；監査は保存されませんでした
ko: ; 감사가 저장되지 않았습니다
zh_hant: ；稽核未儲存

source: （无输出）
en: (No output)
ja: （出力なし）
ko: (출력 없음)
zh_hant: （無輸出）

source: 「%@」将从列表中移除，可随时重新添加（不影响服务器本身）。
en: “%@” will be removed from the list. You can add it again anytime (the server itself is unaffected).
ja: 「%@」はリストから削除されます。いつでも再追加できます（サーバー自体には影響しません）。
ko: '%@'이(가) 목록에서 제거됩니다. 언제든지 다시 추가할 수 있습니다(서버 자체에는 영향을 주지 않습니다).
zh_hant: 「%@」將從清單中移除，可隨時重新新增（不影響伺服器本身）。

source: 「%@」将被永久删除，不影响服务器本身。
en: “%@” will be permanently deleted. The server itself is unaffected.
ja: 「%@」を完全に削除します。サーバー自体には影響しません。
ko: ‘%@’이(가) 영구 삭제됩니다. 서버 자체에는 영향이 없습니다.
zh_hant: 「%@」將被永久刪除，不影響伺服器本身。

source: %@ · %d 个服务 · %d/%d 个容器运行
en: %@ · %d services · %d/%d containers running
ja: %@・%d件のサービス・%d/%d個のコンテナが実行中
ko: %@ · 서비스 %d개 · 컨테이너 %d/%d개 실행 중
zh_hant: %@ · %d 個服務 · %d/%d 個容器執行中

source: %@ %@ 失败：%@
en: %@ %@ failed: %@
ja: %@ %@ 失敗：%@
ko: %@ %@ 실패: %@
zh_hant: %@ %@ 失敗：%@

source: %@ %@ 成功
en: %@ %@ succeeded
ko: %@ %@ 성공

source: %@ 失败：%@
en: %@ failed: %@
ja: %@ に失敗：%@
ko: %@ 실패: %@
zh_hant: %@ 失敗：%@

source: %@ 失败（退出码 %d）
en: %@ failed (exit code %d)
ja: %@ に失敗しました（終了コード %d）
ko: %@ 실패(종료 코드 %d)
zh_hant: %@ 失敗（結束代碼 %d）

source: %@ 成功
en: %@ succeeded
ko: %@ 성공

source: %@ 结果未知
en: %@ result unknown
ja: %@ の結果は不明です
ko: %@ 결과를 알 수 없음
zh_hant: %@ 結果未知
